
USE kick;

--- 안양대학교 주변 디바이스 생성 데이터
INSERT INTO device_info (DEVICE_CODE, device_type, location, battery_level, is_used, created_at) VALUES
('0250928016', '킥보드', ST_GeomFromText('POINT(37.3928 126.9217)', 4326), 100, 0, '2025-09-28'),
('1250928017', '자전거', ST_GeomFromText('POINT(37.3941 126.9235)', 4326), 100, 0, '2025-09-28'),
('0250928018', '킥보드', ST_GeomFromText('POINT(37.3915 126.9209)', 4326), 100, 0, '2025-09-28'),
('1250928019', '자전거', ST_GeomFromText('POINT(37.3932 126.9252)', 4326), 100, 0, '2025-09-28'),
('0250928020', '킥보드', ST_GeomFromText('POINT(37.3909 126.9228)', 4326), 100, 0, '2025-09-28'),
('1250928021', '자전거', ST_GeomFromText('POINT(37.3924 126.9196)', 4326), 100, 0, '2025-09-28'),
('0250928022', '킥보드', ST_GeomFromText('POINT(37.3950 126.9213)', 4326), 100, 0, '2025-09-28'),
('1250928023', '자전거', ST_GeomFromText('POINT(37.3918 126.9241)', 4326), 100, 0, '2025-09-28'),
('0250928024', '킥보드', ST_GeomFromText('POINT(37.3937 126.9205)', 4326), 100, 0, '2025-09-28'),
('1250928025', '자전거', ST_GeomFromText('POINT(37.3920 126.9230)', 4326), 100, 0, '2025-09-28');


-- use kick;
--SET SQL_SAFE_UPDATES = 0;
--DELETE FROM device_use_log;

-- 디바이스 정보 외에 필요한 데이터는 없음. (직접 회원가입하기)